First, we need to install some libraries

**pip install sqlalchemy pandas ipython-sql**

**pip install jupyterlab_sql**

**jupyter serverextension enable jupyterlab_sql --py --sys-prefix**

**jupyter lab build**

**pip install mysql_kernel**

Once you are done installing the libraries then you need to add below command which adds MySQL kernel to jupyter notebook

#### Add kernel to your jupyter:
**python -m mysql_kernel.install**
As of now the configuration to the jupyter is done.

postgres://localhost:5432/postgres
postgres://username:password@localhost:5432/postgres

mysql://user:password@host:port/db_name

### FOR DDLS
1. %load_ext sql
2. %sql mysql+pymysql://root:root@127.0.0.1:3306/de_interview_questions
3. switch to python kernel
4. use %sql before query execution

### For DMLS
1. select mysql Kernel
2. mysql://root:root@127.0.0.1:3306/de_interview_questions

In [ ]:
-- %load_ext sql
-- %sql mysql+pymysql://root:root@127.0.0.1:3306/de_interview_questions

In [ ]:
mysql://root:root@127.0.0.1:3306/de_interview_questions

In [2]:
show databases;

,Database
0,de_interview_questions
1,demo
2,information_schema
3,mysql
4,performance_schema
5,powerbi
6,sakila
7,sys
8,world

### 1,find the max of col1-col5 for each col1

In [3]:

-- %%sql 
-- DROP TABLE IF EXISTS your_table;
-- CREATE TABLE your_table (
--     col1 VARCHAR(10),
--     col2 INT,
--     col3 INT,
--     col4 INT,
--     col5 INT
-- );
-- %%sql
-- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('A', 10, 20, 30, 40);
-- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('A', 15, 25, 35, 45);
-- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('B', 5, 15, 25, 35);
-- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('B', 10, 20, 30, 40);

In [4]:
SELECT col1, 
       GREATEST(MAX(col2), MAX(col3), MAX(col4), MAX(col5)) AS max_value
FROM your_table
GROUP BY col1;

,col1,max_value
0,A,45
1,B,40

In [5]:
-- # %%sql 
-- # CREATE TABLE skills_table (
-- #     Name VARCHAR(50),
-- #     SkillSet VARCHAR(255)
-- # );

In [6]:
-- # %%sql
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('ABC', '.Net, Git, C#');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('XYZ', 'Wordpress, PHP');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('IJK', 'Python, MongoDB, Git');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('DEF', 'SSIS, SSAS, Power BI, SQL Server, Data Warehouse');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('PQR', 'Azure');

In [7]:
SELECT Name, 
    SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 1), ',', -1) AS Skill1, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 1, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 2), ',', -1), NULL) AS Skill2, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 2, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 3), ',', -1), NULL) AS Skill3, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 3, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 4), ',', -1), NULL) AS Skill4, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 4, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 5), ',', -1), NULL) AS Skill5 
FROM 
    skills_table;

,Name,Skill1,Skill2,Skill3,Skill4,Skill5
0,ABC,.Net,Git,C#,None,None
1,XYZ,Wordpress,PHP,None,None,None
2,IJK,Python,MongoDB,Git,None,None
3,DEF,SSIS,SSAS,Power BI,SQL Server,Data Warehouse
4,PQR,Azure,None,None,None,None

In [8]:
-- %%sql
-- CREATE TABLE TableA (
--     Id INT
-- );
-- %%sql
-- CREATE TABLE TableB (
--     Id INT
-- );

In [9]:
-- %%sql
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (0);
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (0);
-- INSERT INTO TableB (Id) VALUES (1);
-- INSERT INTO TableB (Id) VALUES (1);
-- INSERT INTO TableB (Id) VALUES (0);
-- INSERT INTO TableB (Id) VALUES (0);
-- INSERT INTO TableB (Id) VALUES (NULL);

In [14]:
SELECT COUNT(*) FROM TABLEA A INNER JOIN TABLEB B ON A.ID = B.ID;

,COUNT(*)
0,10

In [22]:
SELECT *
FROM TableA A
LEFT JOIN TableB B ON A.Id = B.Id;

,Id
0,1.0
1,0.0
2,NaN

In [20]:
SELECT A.Id
FROM TableA A
LEFT JOIN TableB B ON A.Id = B.Id
UNION
SELECT B.Id
FROM TableA A
RIGHT JOIN TableB B ON A.Id = B.Id

,Id
0,1.0
1,0.0
2,NaN